## Python `pandas` module for data analysis  
pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

Created by YongHua - 14 Feb 2021 @ UoSM

------

Import `pandas` module

In [1]:
import pandas as pd

Read data from CSV file

In [2]:
data = pd.read_csv("C:\PYTHON\jupyter\jupyter_pandas.csv")

Call the data frame

In [3]:
data

     Name  Age  Height  Score
0    Adam   23     178     78
1    John   21     179     79
2    Mike   28     180     80
3   Peggy   25     181     81
4   Nancy   23     182     82
5  Sandra   22     183     83
6    Alex   21     184     84

------

In [4]:
data.shape  # shape of data frame

(7, 4)

In [15]:
data.info()  # a method to access the info of data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Height  7 non-null      int64
 3   Score   7 non-null      int64
dtypes: int64(3), object(1)
memory usage: 352.0+ bytes

In [16]:
# pd.set_option('display.max_columns', 3)  # set the max columns you want to display
# data  # call the data frame

In [17]:
data.head(3)  # shows the first n rows

   Name  Age  Height  Score
0  Adam   23     178     78
1  John   21     179     79
2  Mike   28     180     80

In [18]:
data.tail(3)  # shows the last n rows

     Name  Age  Height  Score
4   Nancy   23     182     82
5  Sandra   22     183     83
6    Alex   21     184     84

In [22]:
data["Name"]  # access the 'keys' (or columns) in the data frame
# or data.Name

0      Adam
1      John
2      Mike
3     Peggy
4     Nancy
5    Sandra
6      Alex
Name: Name, dtype: object

In [25]:
data[["Age", "Height"]]  # access multiple 'keys'

   Age  Height
0   23     178
1   21     179
2   28     180
3   25     181
4   23     182
5   22     183
6   21     184

In [28]:
data.columns  # list out all the columns

Index(['Name', 'Age', 'Height', 'Score'], dtype='object')

In [32]:
data.iloc[2]  # print out the attributes of a certain entry

Name      Mike
Age         28
Height     180
Score       80
Name: 2, dtype: object

In [33]:
data.loc[2]

Name      Mike
Age         28
Height     180
Score       80
Name: 2, dtype: object

In [40]:
filter = data["Age"] >= 23  # do some logic operations to check validity
# 'filter' is just a default name, could be any other name.

In [41]:
filter

0     True
1    False
2     True
3     True
4     True
5    False
6    False
Name: Age, dtype: bool

In [42]:
data[filter]  # now pass the 'filter' variable to filter out data

    Name  Age  Height  Score
0   Adam   23     178     78
2   Mike   28     180     80
3  Peggy   25     181     81
4  Nancy   23     182     82